-- Hash index для таблицы animals по атрибуту animals_sort_id
-- (позволит оптимизировать выборку конкретных животных по видам в функциях получения списка животных определенного вида)

// todo

-- Hash index для таблицы animals_sort по атрибуту animals_type_id
-- (позволит оптимизировать выборку видов животных по типам в функциях получения списка животных определенного типа)

// todo

-- Hash index для таблицы plants по атрибуту plants_sort_id
-- (позволит оптимизировать выборку конкретных растений по видам в функциях получения списка растений определенного вида)

// todo

-- Hash index для таблицы plants_sort по атрибуту plants_type_id
-- (позволит оптимизировать выборку видов растений по типам в функциях получения списка растений определенного типа)

// todo

-- B-Tree индекс для таблицы animals_location по атрибуту world_part_id
-- (позволит оптимизировать выборку видов животных по частям света в функциях получения списка видов животных из определённой части света)

// todo

-- B-Tree индекс для таблицы plants_location по атрибуту world_part_id
-- (позволит оптимизировать выборку видов растений по частям света в функциях получения списка видов растений из определённой части света)

// todo

